# 1. Используем официальный, легкий образ Python
FROM python:3.12-slim

# 2. Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# 3. Копируем файл с зависимостями и устанавливаем их
# Этот шаг кэшируется, чтобы не переустанавливать библиотеки при каждой сборке
COPY requirements.txt .
RUN pip install --no-cache-dir -r requirements.txt

# 4. Копируем остальной код нашего приложения (bot.py)
COPY . .

# 5. Принимаем токен бота как аргумент во время сборки
ARG BOT_TOKEN

# 6. Устанавливаем его как переменную окружения, чтобы Python-скрипт мог его прочитать
ENV BOT_TOKEN=${BOT_TOKEN}

# 7. Указываем команду, которая будет выполняться при запуске контейнера
CMD ["python", "bot.py"]
